Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДополнительныеСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Type>
				<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
			</Type>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Catalogs/Партнеры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура CCRM_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВыполнениеПослеОбработчиковСобытия("CCRM_УправлениеДоступностью");
	Redmine = Новый HTTPСоединение("server.prof-it.ru", , "romik", "CWTb8VSE");
	Wiki = Новый HTTPЗапрос("redmine/projects/ciret/wiki/Матрица_клиента.html");
	HTTPОтвет = Redmine.Получить(Wiki);
	ВикиРедмайн = HTTPОтвет.ПолучитьТелоКакСтроку();
	
	СоздатьТТStorch();
КонецПроцедуры

&НаСервере
Процедура CCRM_УправлениеДоступностью(Отказ, СтандартнаяОбработка, ДополнительныйПараметр)
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	СвойствоРоль = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Юрист (Пользователи)");
	СтрокаСвойстваРоль = Пользователь.ДополнительныеРеквизиты.Найти(СвойствоРоль);
	СвойствоДоступ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Проверено юротделом (Клиенты)");
	ЭтотПартнер = РеквизитФормыВЗначение("Объект");
	СтрокаСвойстваДоступ = ЭтотПартнер.ДополнительныеРеквизиты.Найти(СвойствоДоступ);
	РольДоступна = Ложь;
	Если ЗначениеЗаполнено(СтрокаСвойстваРоль) Тогда
		РольДоступна = СтрокаСвойстваРоль.Значение;
	КонецЕсли;                               
	РедактированиеДоступно = Истина;
	Если ЗначениеЗаполнено(СтрокаСвойстваДоступ) Тогда
		РедактированиеДоступно = НЕ СтрокаСвойстваДоступ.Значение;
	КонецЕсли;
	Если НЕ РольДоступна И НЕ РедактированиеДоступно Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура CCRM_ПриОткрытии(Отказ)
	УстановитьВыполнениеПослеОбработчиковСобытия("CCRM_ПриОткрытииПослеОбработчиковСобытия");
КонецПроцедуры

&НаКлиенте
Процедура CCRM_ПриОткрытииПослеОбработчиковСобытия(Отказ, ДополнительныйПарамет)
	CCRM_ПриОткрытииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура CCRM_ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	СвойствоРоль = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Юрист (Пользователи)");
	СтрокаСвойстваРоль = Пользователь.ДополнительныеРеквизиты.Найти(СвойствоРоль);
	СвойствоДоступ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Проверено юротделом (Клиенты)");
	ЭтотПартнер = РеквизитФормыВЗначение("Объект");
	СтрокаСвойстваДоступ = ЭтотПартнер.ДополнительныеРеквизиты.Найти(СвойствоДоступ);
	РольДоступна = Ложь;
	Если ЗначениеЗаполнено(СтрокаСвойстваРоль) Тогда
		РольДоступна = СтрокаСвойстваРоль.Значение;
	КонецЕсли;                               
	Если НЕ РольДоступна Тогда
		Переменная = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СоздатьТТStorch()
	Перем ЗначениеПоУмолчанию;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК СвойствоСсылка,
	|	ДополнительныеСведения.Значение КАК Значение,
	|	ПОДСТРОКА(ДополнительныеРеквизитыИСведения.Комментарий, 1, 2) КАК Индекс,
	|	ДополнительныеРеквизитыИСведения.Комментарий КАК Комментарий
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	|		ПО ДополнительныеРеквизитыИСведения.Ссылка = ДополнительныеСведения.Свойство
	|			И (ДополнительныеСведения.Объект = &Объект)
	|ГДЕ
	|	ПОДСТРОКА(ДополнительныеРеквизитыИСведения.Подсказка, 1, 14) = ""Торговые точки""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Индекс"
	;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	ВыборкаСведений = Запрос.Выполнить().Выбрать();
	
	РеквизитыФормыСведения = Новый Соответствие();
	РеквизитыФормыЗначения = Новый Соответствие();
	
	ДобавляемыеРеквизиты = Новый Массив;
	Пока ВыборкаСведений.Следующий() Цикл
		КодЗначенияПоУмолчанию = Прав(ВыборкаСведений.Комментарий, СтрДлина(ВыборкаСведений.Комментарий) - 3);
		
		Попытка
			Значение = ЗначениеИзСтрокиВнутр(ВыборкаСведений.Значение);
		Исключение
			Значение = ВыборкаСведений.Значение;
		КонецПопытки;
		
		ТипЗначения = ВыборкаСведений.СвойствоСсылка.ТипЗначения;
		
		Если ЗначениеЗаполнено(КодЗначенияПоУмолчанию) Тогда
			Выполнить(КодЗначенияПоУмолчанию);
			Если ТипЗнч(Значение) <> ТипЗнч(ЗначениеПоУмолчанию) Тогда
				Значение = ЗначениеПоУмолчанию;
			КонецЕсли;
			Типы = Новый Массив;
			Типы.Добавить(ТипЗнч(Значение));
			ТипЗначения = Новый ОписаниеТипов(Типы);			
		КонецЕсли;
		
		
		ЗаголовокЗначения = ВыборкаСведений.СвойствоСсылка.Заголовок;
		ИмяЗначения = СтрЗаменить(ЗаголовокЗначения, " ", "_");
		
		НовыйРеквизит = Новый РеквизитФормы(ИмяЗначения, ТипЗначения, , ЗаголовокЗначения, Истина);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
		Если ТипЗначения.СодержитТип(Тип("ТаблицаЗначений")) Тогда
			Для Каждого Колонка Из Значение.Колонки Цикл
				НовыйРеквизитТЧ = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ИмяЗначения, Истина);
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизитТЧ);
			КонецЦикла;
		КонецЕсли;

		РеквизитыФормыСведения.Вставить(ИмяЗначения, НовыйРеквизит);
		РеквизитыФормыЗначения.Вставить(ИмяЗначения, Значение);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Для Каждого КлючИЗначение Из РеквизитыФормыЗначения Цикл
		Если ТипЗнч(КлючИЗначение.Значение) = Тип("ТаблицаЗначений") Тогда
			ЭтаФорма[КлючИЗначение.Ключ].Загрузить(КлючИЗначение.Значение);
		Иначе
			ЭтаФорма[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	
	CCRM_ОбщийМодульТорговыеТочки.СформироватьИнтерфейс(ЭтаФорма, Элементы.ГруппаТТStorch);

КонецПроцедуры

&НаСервере
Процедура CCRM_ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Название_точки_продаж, "Название точки продаж", "Клиенты");
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Название_торгового_места, "Название торгового места", "Клиенты");
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Город, "Город", "Клиенты");
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Индекс, "Индекс", "Клиенты");
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Адрес, "Адрес", "Клиенты");
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Павильон, "Павильон", "Клиенты");
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Время_работы.Выгрузить(), "Время работы", "Клиенты", Истина);
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Стенд_Storch, "Стенд Storch", "Клиенты");
	CCRM_ОбщийМодульТорговыеТочки.ЗаписатьДопСведения(Объект.Ссылка, ЭтотОбъект.Стенды.Выгрузить(), "Стенды", "Клиенты", Истина);
КонецПроцедуры

&Вместо("КонтактнаяИнформацияПриСменеСтраницы")
Процедура CCRM_КонтактнаяИнформацияПриСменеСтраницы()
	
	УправлениеКонтактнойИнформацией.ВыполнитьОтложеннуюИнициализацию(ЭтотОбъект, Объект);
	УправлениеКонтактнойИнформацией.ВыполнитьОтложеннуюИнициализацию(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформацияStorch");
	
КонецПроцедуры

&НаКлиенте
Процедура CCRM_ГруппаСтраницыПриСменеСтраницыПосле(Элемент, ТекущаяСтраница)	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	Если ТекущаяСтраница.Имя = "ГруппаТТStorch"
		И Не ПараметрыКонтактнойИнформации.ГруппаКонтактнаяИнформация.ВыполненаОтложеннаяИнициализация Тогда
		
		КонтактнаяИнформацияПриСменеСтраницы();
		
	КонецЕсли;
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
КонецПроцедуры
